// Напишите программу, которая
// принимает на вход число (А)
// и выдает сумму чисел от 1 до А
// 7->28
// 4->10
// 8->36

Console.WriteLine("Введите число: ");
string str = Console.ReadLine()
int number = Converter.ToInt32(Console.ReadLine);

